HomeWork-3/reports/withIndex/R100-d5m/wrk2.txt
Running 5m test @ http://localhost:5000
  2 threads and 10 connections
  Thread calibration: mean lat.: 5371.331ms, rate sampling interval: 17432ms
  Thread calibration: mean lat.: 5393.302ms, rate sampling interval: 17301ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.43m     1.32m    4.70m    57.80%
    Req/Sec     2.31      0.46     3.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.44m 
 75.000%    3.56m 
 90.000%    4.25m 
 99.000%    4.66m 
 99.900%    4.69m 
 99.990%    4.71m 
 99.999%    4.71m 
100.000%    4.71m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9396.223     0.000000            1         1.00
   35454.975     0.100000          172         1.11
   62783.487     0.200000          343         1.25
   91750.399     0.300000          514         1.43
  119078.911     0.400000          686         1.67
  146276.351     0.500000          856         2.00
  159645.695     0.550000          942         2.22
  173277.183     0.600000         1028         2.50
  186908.671     0.650000         1113         2.86
  200409.087     0.700000         1200         3.33
  213909.503     0.750000         1285         4.00
  220594.175     0.775000         1327         4.44
  227409.919     0.800000         1369         5.00
  234487.807     0.825000         1413         5.71
  241041.407     0.850000         1455         6.67
  247726.079     0.875000         1498         8.00
  251002.879     0.887500         1519         8.89
  254803.967     0.900000         1541        10.00
  258342.911     0.912500         1563        11.43
  261488.639     0.925000         1583        13.33
  265158.655     0.937500         1605        16.00
  266731.519     0.943750         1615        17.78
  268304.383     0.950000         1626        20.00
  270008.319     0.956250         1638        22.86
  271843.327     0.962500         1649        26.67
  273678.335     0.968750         1661        32.00
  274464.767     0.971875         1663        35.56
  275251.199     0.975000         1671        40.00
  276299.775     0.978125         1674        45.71
  276824.063     0.981250         1681        53.33
  278134.783     0.984375         1686        64.00
  278396.927     0.985938         1691        71.11
  278396.927     0.987500         1691        80.00
  279445.503     0.989062         1694        91.43
  279707.647     0.990625         1697       106.67
  279969.791     0.992188         1700       128.00
  279969.791     0.992969         1700       142.22
  280494.079     0.993750         1701       160.00
  280756.223     0.994531         1702       182.86
  281018.367     0.995313         1705       213.33
  281018.367     0.996094         1705       256.00
  281018.367     0.996484         1705       284.44
  281280.511     0.996875         1707       320.00
  281280.511     0.997266         1707       365.71
  281280.511     0.997656         1707       426.67
  281542.655     0.998047         1710       512.00
  281542.655     0.998242         1710       568.89
  281542.655     0.998437         1710       640.00
  281542.655     0.998633         1710       731.43
  281542.655     0.998828         1710       853.33
  281542.655     0.999023         1710      1024.00
  281542.655     0.999121         1710      1137.78
  281542.655     0.999219         1710      1280.00
  281542.655     0.999316         1710      1462.86
  281542.655     0.999414         1710      1706.67
  282329.087     0.999512         1711      2048.00
  282329.087     1.000000         1711          inf
#[Mean    =   145567.766, StdDeviation   =    79007.262]
#[Max     =   282066.944, Total count    =         1711]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    1.68s 
 75.000%    1.80s 
 90.000%    1.92s 
 99.000%    2.14s 
 99.900%    2.23s 
 99.990%    2.39s 
 99.999%    2.39s 
100.000%    2.39s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1107.967     0.000000            1         1.00
    1488.895     0.100000          172         1.11
    1551.359     0.200000          343         1.25
    1600.511     0.300000          518         1.43
    1642.495     0.400000          687         1.67
    1682.431     0.500000          860         2.00
    1701.887     0.550000          943         2.22
    1726.463     0.600000         1029         2.50
    1747.967     0.650000         1113         2.86
    1773.567     0.700000         1198         3.33
    1800.191     0.750000         1284         4.00
    1817.599     0.775000         1330         4.44
    1828.863     0.800000         1369         5.00
    1844.223     0.825000         1412         5.71
    1865.727     0.850000         1456         6.67
    1884.159     0.875000         1498         8.00
    1898.495     0.887500         1520         8.89
    1916.927     0.900000         1542        10.00
    1935.359     0.912500         1563        11.43
    1950.719     0.925000         1583        13.33
    1969.151     0.937500         1605        16.00
    1980.415     0.943750         1615        17.78
    1999.871     0.950000         1627        20.00
    2008.063     0.956250         1637        22.86
    2025.471     0.962500         1647        26.67
    2060.287     0.968750         1659        32.00
    2067.455     0.971875         1663        35.56
    2076.671     0.975000         1669        40.00
    2093.055     0.978125         1675        45.71
    2103.295     0.981250         1681        53.33
    2113.535     0.984375         1685        64.00
    2119.679     0.985938         1687        71.11
    2134.015     0.987500         1692        80.00
    2138.111     0.989062         1694        91.43
    2140.159     0.990625         1695       106.67
    2166.783     0.992188         1698       128.00
    2174.975     0.992969         1699       142.22
    2185.215     0.993750         1701       160.00
    2187.263     0.994531         1702       182.86
    2191.359     0.995313         1704       213.33
    2199.551     0.996094         1705       256.00
    2199.551     0.996484         1705       284.44
    2215.935     0.996875         1706       320.00
    2224.127     0.997266         1708       365.71
    2224.127     0.997656         1708       426.67
    2224.127     0.998047         1708       512.00
    2224.127     0.998242         1708       568.89
    2226.175     0.998437         1709       640.00
    2226.175     0.998633         1709       731.43
    2226.175     0.998828         1709       853.33
    2303.999     0.999023         1710      1024.00
    2303.999     0.999121         1710      1137.78
    2303.999     0.999219         1710      1280.00
    2303.999     0.999316         1710      1462.86
    2303.999     0.999414         1710      1706.67
    2387.967     0.999512         1711      2048.00
    2387.967     1.000000         1711          inf
#[Mean    =     1692.396, StdDeviation   =      174.013]
#[Max     =     2385.920, Total count    =         1711]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1780 requests in 5.00m, 1.30MB read
Requests/sec:      5.93
Transfer/sec:      4.44KB